/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Ogiltigt värde.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "Värdet ”%@” är ogiltigt.";

/* NSFormattingError */
"Err2048-C" = "Formateringsfel.";

/* NSFileLockingError */
"Err255-C" = "Filen kunde inte låsas.";

/* NSFileLockingError */
"Err255-R" = "Filen kanske redan är låst, eller du kanske inte har tillräckliga behörigheter för att låsa den.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Filen ”%@” kunde inte låsas.";

/* NSFileReadUnknownError */
"Err256" = "Filen kunde inte öppnas.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Filen ”%@” kunde inte öppnas.";

/* NSFileReadNoPermissionError */
"Err257" = "Filen kunde inte öppnas eftersom du inte har tillräckliga behörigheter.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Du har inte tillräckliga behörigheter.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Om du vill se eller ändra behörigheterna markerar du objektet i Finder och väljer Arkiv > Visa info.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Filen ”%@” kunde inte öppnas eftersom du inte har tillräckliga behörigheter.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Ogiltigt filnamn.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Objektet kunde inte öppnas eftersom filnamnet ”%@” är ogiltigt.";

/* NSFileReadCorruptFileError */
"Err259" = "Filen kunde inte öppnas eftersom den inte är av rätt format.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Filen är inte av rätt format.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Filen kan vara förstörd, trunkerad eller av ett annat filformat än du antagit.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Filen ”%@” kunde inte öppnas eftersom formatet är fel.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Filen finns inte.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Filen ”%@” finns inte.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Filen kunde inte öppnas med den angivna teckenkodningen.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Den angivna textkodningen är inte tillämplig.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Textkodningen %@ är inte tillämplig.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Filen kan ha sparats med en annan textkodning, eller så är den inte en textfil.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Filen kunde inte öppnas med teckenkodningen %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Filen ”%2$@” kunde inte öppnas med teckenkodningen %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Filen kunde inte öppnas eftersom den angivna URL-typen inte stöds.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Den angivna URL-typen stöds inte.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Filen ”%1$@” kunde inte öppnas eftersom URL-typen %2$@ inte stöds.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Filen kunde inte öppnas eftersom URL-typen %@ inte stöds.";

/* NSFileReadTooLargeError */
"Err263" = "Filen kunde inte öppnas eftersom den är för stor.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Filen är för stor.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Filen ”%@” kunde inte öppnas eftersom den är för stor.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Filen kunde inte öppnas eftersom innehållets teckenkodning inte kunde avgöras.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Innehållets teckenkodning kunde inte avgöras.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Det kanske är möjligt att öppna filen genom att uttryckligen ange en teckenkodning.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Filen ”%@” kunde inte öppnas eftersom innehållets teckenkodning inte kunde avgöras.";

/* NSUserCancelledError */
"Err3072-C" = "Åtgärden avbröts.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "”%@” kunde inte tas bort.";

/* NSFileNoSuchFileError */
"Err4-C" = "Filen finns inte.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Filen ”%@” finns inte.";

/* NSFileWriteUnknownError */
"Err512" = "Filen kunde inte sparas.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "”%1$@” kunde inte kopieras till ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "”%1$@” kunde inte länkas till ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "”%1$@” kunde inte flyttas till ”%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "”%@” kunde inte tas bort.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Filen ”%2$@” kunde inte sparas i mappen ”%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Filen ”%@” kunde inte sparas.";

/* NSFileWriteNoPermissionError */
"Err513" = "Filen kunde inte sparas eftersom du inte har tillräckliga behörigheter.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "”%1$@” kunde inte kopieras eftersom du inte har de behörigheter som krävs för ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "”%1$@” kunde inte länkas eftersom du inte har de behörigheter som krävs för ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "”%1$@” kunde inte flyttas eftersom du inte har de behörigheter som krävs för ”%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "”%@” kunde inte flyttas eftersom du inte har de behörigheter som krävs.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Du inte har tillräckliga behörigheter.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Om du vill se eller ändra behörigheterna markerar du objektet i Finder och väljer Arkiv > Visa info.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Du har inte tillräckliga behörigheter för att spara filen ”%2$@” i mappen ”%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Du har inte tillräckliga behörigheter för att spara filen ”%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Objektet kunde inte sparas eftersom filnamnet är ogiltigt.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Objektet kunde inte tas bort eftersom filnamnet ”%@” är ogiltigt.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Ogiltigt filnamn.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Objektet kunde inte sparas eftersom filnamnet ”%@” är ogiltigt.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Filen kunde inte sparas med den angivna teckenkodningen.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Den angivna textkodningen är inte tillämplig.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Textkodningen %@ är inte tillämplig.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Välj, om möjligt, en annan textkodning.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Filen kunde inte sparas med teckenkodningen %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Filen ”%2$@” kunde inte sparas med teckenkodningen %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Filen kunde inte sparas eftersom den angivna URL-typen inte stöds.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Den angivna URL-typen stöds inte.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Filen ”%1$@” kunde inte sparas eftersom URL-typen %2$@ inte stöds.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Filen kunde inte sparas eftersom URL-typen %@ inte stöds.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Filen kunde inte sparas eftersom det saknas ledigt utrymme.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "”%1$@” kunde inte kopieras till ”%2$@” eftersom det inte finns tillräckligt utrymme.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "”%1$@” kunde inte länkas till ”%2$@” eftersom det inte finns tillräckligt utrymme.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "”%1$@” kunde inte flyttas till ”%2$@” eftersom det inte finns tillräckligt utrymme.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Det finns inte tillräckligt med ledigt utrymme.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Enheten ”%@” är full.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Ta bort några filer från enheten och försök igen.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Det går inte att spara filen ”%@” eftersom det saknas ledigt utrymme.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Det går inte att spara filen ”%1$@” eftersom enheten ”%2$@” är full.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Åtgärden kunde inte slutföras. (%1$@ fel %2$ld)";

